编码<中文汉字> : GBJ(简)/GB2312、GBF(繁)/<GB/T 12345>、GBK(简繁)/MS936、BIG5(大五码)(繁)、GB18030(简繁)、CNS11643(Big5-2003)(繁)
GB : 国家标准
GB2312(1980) : 总字符7445，非汉字682，汉字6763，一级字3755，以拼音排序，二级字3008，以偏旁排序。
GB/T 12345(1990)【未被中国大陆以外地区接受】: 总字符7583，非汉字717，汉字6866，其中 简体字6763 转为繁体，增补一简对多繁 繁体字103
GBK(1995) : 总字符21886，非汉字883，汉字21003，GBK 为微软标准而非中华人民共和国标准，随 WIN95 发布
BIG5(1984) : 非汉字408，13060汉字
GB18030(2000 CJK-Ext-A/2005 CJK-Ext-B) : 


01.字体名称漫谈

常见的英文名称中有 Serif 和 Sans Serif  即为英文的两大字体类型 衬线和无衬线，代表为 Times New Roman(Serif) 和 Arial(Sans Serif)

日文字体受英文和中文影响也有衬线和无衬线，日文主要使用的衬线体为明朝体，日本的明朝体以宋(朝)体为基础，融入结合了明朝时候的宋体，

又经过清朝时候的明朝体（清朝时的明朝体称为明清体）的过渡，逐渐形成了近现代的日本独有的明朝字体

日本的无衬线体是受西方英文无衬线字体而影响产生的 黑体，ゴシック体(Goshikku-tai，音译即“哥特体”)，在西方最早的时候 无衬线体并不叫做 Sans Serif

而是叫做 Gothic，这是因为 Gothic 字体并非都是无衬线，到了后期，西方专门把 Gothic 字体中的无衬线字体抽离而和 Serif 对应叫做 Sans Serif

而在最早传入日本的时候 叫 Gothic，所以日本就一直沿用了下去

需要注意的是，日本在黑体的基础上又发展了丸体，既中文的圆体，日文名为 丸ゴシック体，因此与其对应的黑体又称为 角ゴシック体

我们在日文字体名称经常可以看见 Kaku Gothic 实际上即为黑体，Maru Gothic 为圆体，而有些日文字体名称省略了 Kaku，只保留 Gothic，也是黑体

日文黑体对应的日文汉字名称为 黒体(注意其中的黑字为日文异体字，而体字并非繁体的體)，日文圆体对应的日文汉字名称为 圓黒体

日语中 書体(しょたい) 指的是中文的 字体，日语中的 字体(じたい/フォント) 有特指 两种不同的字形的意义，比如 简体 学 和 繁体 學，但有时候又把 字体等同于書体
